{
    "items": [
        {
            "id": 1,
            "author": "Siddhi Bhanushali",
            "firstName": "Siddhi",
            "LastName": "Bhanushali",
            "shortTitle": "Basic Git Commands A Developer Should Know",
            "category": "Open-Source",
            "img": "/assets/images/Open-Source/id1/id1.jpg",
            "shortDesc": "Some Basic Git Commands That Every Developer Should Know...",
            "blogContent": "<p class='fs-5 mb-5'> Suppose you along with your friends are working on a project . Now different people will work on different features. How will you track your changes ? How will you complete the work together? The answer is git. Git is a distributed version control system. Why should we use Git? Git has many benefits some of them are as follows </p><ul class='fs-5 mb-5'> <li>You can contribute to open source projects. </li><li>Developers can add code in parallel manner.</li><li>Multiple people can work at same time.</li><li>You can track changes, switch to previous versions etc.</li></ul><h2 class='fw-bolder mb-5 mt-5'>Here are some basic Git commands a developer should be familiar with :</h2><pre class='language-html'><code onclick='clipboardcopy(this.innerHTML)'>git init</code></pre><p class='fs-5 mb-5'>This command is used to initialize a folder in local computer to a git repository. In simple words, it converts a folder into repository.</p><pre class='language-html'><code onclick='clipboardcopy(this.innerHTML)'>git <strong>clone</strong> &#60;url of repo&#62;</code></pre><p class='fs-5 mb-5'>This is used to copy a remote repository to a local computer.</p><pre class='language-html'><code onclick='clipboardcopy(this.innerHTML)'>git branch &#60;branch name&#62;</code></pre><p class='fs-5 mb-5'>Branches are often used when different people are working on different features. They can create a branch & work on it. This command is used to create a new branch.</p><pre class='language-html'><code onclick='clipboardcopy(this.innerHTML)'>git checkout &#60;branch-name&#62;</code></pre><p class='fs-5 mb-5'>After creating a new branch you need to switch to it. This command is used to switch to a different branch.</p><pre class='language-html'><code onclick='clipboardcopy(this.innerHTML)'>git add &#60;file-name&#62;</code></pre><p class='fs-5 mb-5'>You can use this command to track your files.</p><pre class='language-html'><code onclick='clipboardcopy(this.innerHTML)'>git add .</code></pre><p class='fs-5 mb-5'>If you want to track all the files you can use.</p><pre class='language-html'><code onclick='clipboardcopy(this.innerHTML)'>git commit -m \"commit message\"</code></pre><p class='fs-5 mb-5'>This command saves or commits your changes. You generally have to include a meaningful message while committing.</p><pre class='language-html'><code onclick='clipboardcopy(this.innerHTML)'>git push &#60;remote&#62; &#60;branch-name&#62;</code></pre><p class='fs-5 mb-5'>Now after saving all the changes it's time to push those changes from your local computer to a remote repository. </p><pre class='language-html'><code onclick='clipboardcopy(this.innerHTML)'>git pull</code></pre><p class='fs-5 mb-5'>This Command allows you to fetch all the changes pushed by other people.</p><pre class='language-html'><code onclick='clipboardcopy(this.innerHTML)'>git status</code></pre><p class='fs-5 mb-5'>This command gives you the status of your repository. It tells you your current branch, how many files are changed,are the files tracked ? etc. </p><br><h3 class='mb-5'>These were some basic Git commands a developer should know and use it while making projects.</h3>",
            "tags": [
                "Open-Source",
                "Git",
                "VCS"
            ],
            "class": "Yecond Year",
            "branch": "Computer",
            "date": "November 01, 2021",
            "linkedin": "https://www.linkedin.com/in/siddhi-bhanushali-4178591b2/",
            "github": "https://github.com/siddhi-244"
        },
        {
            "id": 2,
            "author": "Bhavik Oza",
            "firstName": "Bhavik",
            "LastName": "Oza",
            "shortTitle": "Install Kali Linux as a Portable Live USB",
            "category": "General",
            "img": "/assets/images/General/id2/kali.png",
            "shortDesc": "Install Kali Linux as a Portable Live USB for Pen-Testing & Hacking on Any Computer",
            "blogContent": "<p class='fs-5 mb-3'>&emsp;Kali Linux is the go-to Linux distribution for penetration testing and ethical hacking. Still, it's not recommended for day-to-day use, such as responding to emails, playing games, or checking Facebook. That's why it's better to run your Kali Linux system from a bootable USB drive.</p><p class='fs-5 mb-3'>The hacker-friendly Debian-based distro did receive a major update by Offensive Security in late-2019 that changed the default desktop environment from the heavyweight Gnome to a more lightweight Xfce, making Kali more snappy and responsive overall. But we still can't recommend it as your daily driver unless you hack 24 hours a day, 7 days a week.</p><p class='fs-5 mb-3'>Using Kali in a dual-boot situation is the way to go if you have a dedicated machine, but for something more portable, the live version on a USB flash drive is what you want. If you have a spare computer that you're going to be using for your white-hat endeavors only, then yes, by all means, install Kali as the primary system so that you can take full use of the computer's hardware. </p><h2 class='fw-bolder mb-3 mt-5'>What You'll Need :</h2><p class='fs-5 mb-3'>&emsp;To follow along, you'll need a USB flash drive. You could get away with using one as small as 4 GB for the basics or 8 GB if you want persistence, but a larger one may come in handy, especially if you want the ability to save data. When it comes to 4 GB USB sticks, you'll mostly only find USB 2.0 speeds unless you spend a crazy amount of money on an Kingston IronKey or iStorage datAshur Pro with 256-bit encryption.</p><p class='fs-5 mb-3'>You'll also need the Kali Live ISO file and an imaging program like Etcher or Rufus, which we'll outline below.</p><h2 class='fw-bolder mb-5 mt-5'>Step-1 : Download the Right Kali Linux Version</h2><p class='fs-5 mb-3'>While there are many different types of Kali Linux images, the one we want for a portable live version is the \"Live\" download. You can choose between 64-Bit for AMD (for Intel chips), 64-Bit for ARM64 (such as the M1 chips in newer Macs), and 32-Bit for i386 (which you likely won't ever use because it's so outdated).</p><p class='fs-5 mb-3'>Visit <a target=\"_blank\" href='kali.org/downloads'>Kali</a> and download the appropriate Live image. We'll be using the 64-Bit for AMD since we're using an Intel Chip. No matter which one you choose, note that you will only be able to use the Xfce desktop environment, and you won't be able to specify additional (meta)packages to install.</p><div class=\"mb-4\"> <img class=\"img-fluid rounded\" src=\"/assets/images/General/id2/id2.1.jpg\"/></div><h2 class='fw-bolder mb-5 mt-5'>Step-2 : Install a USB Formatting Tool</h2><p class='fs-5 mb-3'>On Linux and macOS computers, you could use the dd command to copy over the Kali Live image to the USB drive, but you always run the risk of choosing the wrong drive and royally screwing yourself over by overwriting an important drive. Because of that, we recommend using a USB formatting tool. If you're on Windows, Rufus is a good tool, but Etcher works for Linux, macOS, and Windows, so we're using that.</p><p class='fs-5 mb-3'>Head to balena.io/etcher and his the \"Download\" button, which should detect which system you're on ad give you the right version. If not, hit the drop-down button next to it to choose your OS. Once downloaded, install it like you would any other app. For example, on macOS, open the DMG, drag balenaEtcher over to your Applications folder, then eject the DMG and delete it.</p><div class=\"mb-4\"> <img class=\"img-fluid rounded\" src=\"/assets/images/General/id2/id2.2.jpg\"/></div><h2 class='fw-bolder mb-5 mt-5'>Step-3 : Flash the Kali Live Image to the Flash Drive</h2><p class='fs-5 mb-3'>Open Etcher, then click on \"Select Image.\" You may see options for \"Flash from file\" and \"Flash from URL\" instead; choose \"Flash from file\" if you see that.</p><div class=\"mb-4\"> <img class=\"img-fluid rounded\" src=\"/assets/images/General/id2/id2.3.jpg\"/></div><p class='fs-5 mb-3'>Navigate to the Kali image you downloaded in Step 1, and select it. Then, you need to click on \"Select Target\" to choose your USB flash drive. Double- and triple-check that you're selecting the right drive by looking at the drive name and space available.</p><div class=\"mb-4\"> <img class=\"img-fluid rounded\" src=\"/assets/images/General/id2/id2.4.jpg\" /></div><p class='fs-5 mb-3'>Now all that's left to do is click on \"Flash!\" This will reformat your flash drive so that everything will be erased and overwritten with the Kali Live image.</p><div class=\"mb-4\"> <img class=\"img-fluid rounded\" src=\"/assets/images/General/id2/id2.5.jpg\"/></div><p class='fs-5 mb-3'>You may be asked to input your admin password to let Etcher do its magic, so go ahead and do that if it happens. Then, Etcher will show a progress bar indicating how much time is left for flashing the content over. You'll see a \"Flash Complete\" message when it's done.</p><div class=\"mb-4\"> <img class=\"img-fluid rounded\" src=\"/assets/images/General/id2/id2.6.jpg\"/></div><h2 class='fw-bolder mb-5 mt-5'>Step-4 : Boot from the Kali Live USB</h2><p class='fs-5 mb-3'>Now it's time to boot to your new Kali Live USB flash drive, but the process will vary based on the computer brand, operating system, and processor.</p><p class='fs-5 mb-3'>On macOS, it's much easier. If you have an Apple M1 chip, just power down your Mac, then turn it on and hold the power button until you see the startup window. On Intel-based Macs, press the Option key immediately after turning on or restarting the computer until you see the startup window. Then, just select the Kali Live flash drive to boot from.</p><p class='fs-5 mb-3'>To find out how to enter BIOS and change the boot settings, and/or load the startup menu, google \"boot from USB drive\" for your computer model and OS and find the appropriate instructions. There are just too many to list here where there are plenty of good manuals online with instructions for booting from external disks.</p><h2 class='fw-bolder mb-5 mt-5'>Step-5 : Choose How You Want to Boot Kali</h2><p class='fs-5 mb-3'>Once you've booted into the Kali Live USB flash drive, you should see a few different options for which version of Kali you want to load. They may include:</p><ul class=\"fs-5 mb-3\"> <li><strong>Live system</strong> : This will boot up Kali Live. In this mode, you cannot save any changes. No reports, no logs, no other data — none of these changes are saved. This way, you start with a fresh Kali Live every time you boot it up. Data is only saved to RAM, not the drive.</li><li><strong>Live system (fail-safe mode)</strong> : Same as the live system, but a more robust version in case the system fails. That way, the failed system won't ruin your flash drive. This is a good option if you need to troubleshoot a problematic computer.</li><li><strong>Live system (forensic mode): </strong> : Same as the live system with forensic-friendly tools so that you can recover files, gather evidence, and perform other forensic tasks on a host machine. However, the internal hard drive is never touched, and external devices and media will not auto-mount so that you have complete control over what you can connect to.</li><li><strong>Live system (persistence) : </strong> Same as the live system, only changes will be saved, and it will allow you to inspect the host system without worrying about running or locked processes.</li><li><strong>Live system (encrypted persistence): </strong> Same as the live system (persistence), only encrypted with LUKS, so it's harder for others to access your data.</li><li><strong>Live system (encrypted persistence): </strong> Same as the live system (persistence), only encrypted with LUKS, so it's harder for others to access your data.</li><li><strong>Start installer: </strong> This lets you start the installer to install Kali on an internal drive.</li><li><strong>Start installer with speech synthesis: </strong> Same as start installer, only with speech instructions to help navigate.</li><li><strong>Advanced options: </strong> Includes options such as MemTest, Hardware Detection, etc..</li></ul><p class='fs-5 mb-3'>To boot it up without saving any changes, just choose the \"Live system\" option, which will take you right into the new Xfce desktop environment as a non-root user. However, if you want to save your changes, boot using \"Live system (persistence)\" or \"Live system (encrypted persistence)\" instead.</p><h2 class='fw-bolder mb-5 mt-5'>Step-6 : Set Up Persistence on Kali Live</h2><p class='fs-5 mb-3'>Choosing one of the persistence options doesn't mean it'll work out of the box. There is some configuration to perform first, mainly creating a new partition to save all your data. Kali has some excellent instructions on doing so, which we are using.</p><p class='fs-5 mb-3'>To create a partition above the Kali Live partitions, ending at 7 GB, issue the following three commands in a terminal window as the kali user, which will keep the Live options in the 7 GB partition, freeing up the rest for your data storage. Make sure you're doing this from your Kali Live system you just booted into.</p><pre class='language-html'><code >~$ end=7GiB\n~$ read start _ &#60; &#60;(du -bcm kali-linux-2021.1-live-arm64.iso | tail -1); echo $start\n~$ parted /dev/sdb mkpart primary ${start}MiB $end</code></pre><p class='fs-5 mb-5'>When that's done, you should now have a third partition labeled something like /dev/sdb3 or /dev/disk1s3. Check your volume identifier because you'll need it for the rest of this process.</p><p class='fs-5 mb-5'>If you want to add some encryption in case you think someone might get a hold of your drive, issue the following two commands as kali. Type \"YES\" in all caps if prompted to proceed with overwriting the new partition. When asked for a passphrase, choose one and enter it twice. You can skip encryption if you don't want it.</p><pre class='language-html'><code >~$ cryptsetup --verbose --verify-passphrase luksFormat /dev/sdb3\n~$ cryptsetup luksOpen /dev/sdb3 my_usb</code></pre><p class='fs-5 mb-5'>Next, run the following two commands as kali to create an ext3 file system labeled \"persistence.\" If you chose to skip encryption, use these:</p><pre class='language-html'><code >~$ mkfs.ext3 -L persistence /dev/sdb3\n~$ e2label /dev/sdb3 persistence</code></pre><p class='fs-5 mb-5'>Next, run the following two commands as kali to create an ext3 file system labeled \"persistence.\" If you chose to skip encryption, use these:</p><pre class='language-html'><code >~$ mkfs.ext3 -L persistence /dev/sdb3\n~$ e2label /dev/sdb3 persistence</code></pre><p class='fs-5 mb-5'>If you encrypted the partition, use:</p><pre class='language-html'><code >~$ mkfs.ext3 -L persistence /dev/mapper/my_usb\n~$ e2label /dev/mapper/my_usb persistence</code></pre><p class='fs-5 mb-5'>Next, create a mount point, mount the new partition there, create a configuration file to enable persistence, then unmount the partition. If you didn't encrypt the partition, use : </p><pre class='language-html'><code >~$ mkdir -p /mnt/my_usb\n~$ mount /dev/sdb3 /mnt/my_usb\n~$ echo \"/ union\" > /mnt/my_usb/persistence.conf\n~$ umount /dev/sdb3</code></pre><p class='fs-5 mb-5'>If you encrypted the partition, use : </p><pre class='language-html'><code >~$ mkdir -p /mnt/my_usb/\n~$ mount /dev/mapper/my_usb /mnt/my_usb\n~$ echo \"/ union\" > /mnt/my_usb/persistence.conf\n~$ umount /dev/mapper/my_usb</code></pre><p class='fs-5 mb-5'>If you didn't encrypt the partition, you're done. If you did, you have one more command to issue as kali, which will close the encrypted channel for the new partition : </p><pre class='language-html'><code >~$ cryptsetup luksClose /dev/mapper/my_usb</code></pre><p class='fs-5 mb-5'>Now, reboot into Kali Live and choose the appropriate system, and everything should be all set.</p><h2 class='fw-bolder mb-5 mt-5'>Step-7 : Add a Password for the Root User</h2><p class='fs-5 mb-5'>On new versions of Kali, you're a non-root user by default, but you can issue root commands as a regular user by using:</p><pre class='language-html'><code >~$ sudo su</code></pre><p class='fs-5 mb-5'>If you're asked for a password, use kali. However, Kali Live might not attach a password to the root user, so you'll have to create one if you don't want other people to get in and mess with your system. If it does have one, you can change it to something better. Use passwd root with root privileges to do that. Enter your chosen password, then verify it.</p><pre class='language-html'><code >~# passwd \n\nrootNew password:Retype \nnew password: \n\npasswd: password updated successfully</code></pre>",
            "tags": [
                "Kali-Linux",
                "Git",
                "VCS"
            ],
            "date": "November 04, 2021",
            "linkedin": "https://www.linkedin.com/in/bhavik-oza-678118134",
            "github": "https://github.com/Bhaviktutorials"
        },
        {
            "id": 3,
            "author": "Piyush Dixit",
            "firstName": "Piyush",
            "LastName": "Dixit",
            "shortTitle": "Introduction To Web-Development",
            "category": "Web-Dev",
            "img": "/assets/images/Web-Dev/id3/id3.jpg",
            "shortDesc": "An Overview On The Working Of Web Development For Beginners.",
            "blogContent": "<h2 class='fw-bolder mb-3 mt-5'>Introduction To Web Development</h2><p class='fs-5 mb-3'>Web development is a highly engrossing domain since past few years.</p><p class='fs-5 mb-3'>May it be a website assigned for the vaccination purpose or a place to find you the best vacation spot you can perceive it almost everywhere.</p><p class='fs-5 mb-3'>If you are an individual aspiring to build a website of your own but wondering where to begin from, here is the roadmap & some basics to begin with.</p><h2 class='fw-bolder mb-3 mt-5'>So, what a website basically means?</h2><p class='fs-5 mb-3'>It is a collection of web pages & content related to it that is identified by a common domain name and published on at least one web server available around us.</p><p class='fs-5 mb-3'>Generally, a website is divided into 2 branches.</p><ul class='fs-5 mb-3'> <li>Front-End</li><li>Back-End</li></ul><p class='fs-5 mb-3'>Both the branches function simultaneously but are quite different from each other. Each side needs to communicate & operate effectively with the other as a single unit to improve the website's experience and functionality.</p><h2 class='fw-bolder mb-4 mt-5'>Front-end</h2><p class='fs-5 mb-3'>This is the part of a website that the user interacts with directly. It is also referred to as the 'client-side' of the application.</p><p class='fs-5 mb-3'>Primarily the interface that a user experience while working on it.</p><p class='fs-5 mb-3'>There are variety of options to structure this out, some of them are HTML, CSS, JS, wherein HTML is dedicated as the body of the website while CSS is used in styling & making the website presentable.</p><p class='fs-5 mb-3'>Responsiveness & performance are the two main objectives of the Front-end.</p><h2 class='fw-bolder mb-4 mt-5'>Back-end</h2><p class='fs-5 mb-3'>As the name itself suggests, it is the part of the website that users cannot see and interact with.</p><p class='fs-5 mb-3'>It stores and arranges the data, also makes sure everything on the 'client side' of the website works fine.</p><p class='fs-5 mb-3'>It can be mentioned as 'server side' of the website.</p><p class='fs-5 mb-3'>It can be built on languages like Ruby, PHP, SQL, etc.</p><h2 class='fw-bolder mb-4 mt-5'>Let’s get on to the next step!</h2><p class='fw-bolder fs-5 mb-3 italic'>Q. Where can you carry out the programming and code execution process?</p><p class='fs-5 mb-3'>There are a number of software's available, such as Atom, Visual Studio code, NetBeans, etc.</p><p class='fs-5 mb-3'>'Visual studio code is a preferred software by web developers because of its easy-to-use function'.</p><h2 class='fw-bolder mb-3 mt-5'>Full stack web development : </h2><p class='fs-5 mb-3'>This term is given to a Full Stack Developer who works with the Back End — or server side — of the application as well as the Front End, or client side.</p><p class='fs-5 mb-3'>\"Web development helps in making the ideas come alive on the Internet\"</p>",
            "tags": [
                "Web-Dev",
                "Frontend",
                "Backend"
            ],
            "date": "November 08, 2021",
            "linkedin": "https://www.linkedin.com/in/piyush-dixit-327055218",
            "github": "https://github.com/PiyushDixit7"
        },
        {
            "id": 4,
            "author": "Bhavik oza",
            "firstName": "Bhavik",
            "LastName": "Oza",
            "shortTitle": "Termux Commands List",
            "category": "General",
            "img": "/assets/images/General/id4/id4.jpg",
            "shortDesc": "Termux Commands List",
            "blogContent": "<h2 class='fw-bolder mb-4 mt-5'>About Termux Emulator</h2><p class='fs-5 mb-4'>Termux is an Android terminal emulator and Linux environment app that works directly with no rooting or setup required. A minimal base system is installed automatically – additional packages are available using the APT package manager. You can go here for more information.</p><h4 class='italic mb-4'>Termux File and Directory Creating</h4><pre class='language-html'><code>touch [file name]</code></pre><p class='fs-5 mb-4'>Used To Create New File</p><pre class='language-html'><code>cat > [file name]</code></pre><p class='fs-5 mb-4'>Used To Create New File With Content</p><pre class='language-html'><code>echo 'hello world' > [file name] </code></pre><p class='fs-5 mb-4'>Create New File With Content</p><pre class='language-html'><code>cat >> [file name]</code></pre><p class='fs-5 mb-4'>Add Content In Existing File</p><pre class='language-html'><code>mkdir [name] </code></pre><p class='fs-5 mb-4'>Create a Directory or Folder</p><h4 class='italic mb-4'>Termux Usage of CD Commands</h4><pre class='language-html'><code>cd </code></pre><p class='fs-5 mb-4'>Change Directory</p><pre class='language-html'><code>cd / </code></pre><p class='fs-5 mb-4'>Back to root directory</p><pre class='language-html'><code>cd .. </code></pre><p class='fs-5 mb-4'>Change current directory to parent directory</p><pre class='language-html'><code>cd – </code></pre><p class='fs-5 mb-4'>Move one directory back from current location</p><pre class='language-html'><code>cd — – </code></pre><p class='fs-5 mb-4'>Show last working directory from where we moved</p><pre class='language-html'><code>cd ~ </code></pre><p class='fs-5 mb-4'>Move to users home directory from anywhere</p><h4 class='italic mb-4'>Termux Copy and Move Commands</h4><pre class='language-html'><code>cp [file name] [location where you want copy]</code></pre><p class='fs-5 mb-4'>Used to copy any file</p><pre class='language-html'><code>cp -r </code></pre><p class='fs-5 mb-4'>Used to copy any directory</p><pre class='language-html'><code>cp -n </code></pre><p class='fs-5 mb-4'>No file overwrite</p><pre class='language-html'><code>mv [file name] [location where you want copy]</code></pre><p class='fs-5 mb-4'>Used to permanently move any file</p><pre class='language-html'><code>mv -v </code></pre><p class='fs-5 mb-4'>To move any directory</p><pre class='language-html'><code>mv [file1 name] [new file2 name] </code></pre><p class='fs-5 mb-4'>Move or rename two file at a same time</p><pre class='language-html'><code>mv -i </code></pre><p class='fs-5 mb-4'>Interactive prompt before overwrite</p><pre class='language-html'><code>mv -f </code></pre><p class='fs-5 mb-4'>Force move by overwriting destination files without prompt</p><h4 class='italic mb-4'>Termux ls Commands</h4><pre class='language-html'><code>ls</code></pre><p class='fs-5 mb-4'>List Directory</p><pre class='language-html'><code>ls –help </code></pre><p class='fs-5 mb-4'>Show display how to use 'ls' command</p><pre class='language-html'><code>ls -l </code></pre><p class='fs-5 mb-4'>Show file action like – modified, date and time, owner of file, permissions Etc.</p><pre class='language-html'><code>ls -n </code></pre><p class='fs-5 mb-4'>To display UID and GID directory</p><pre class='language-html'><code>ls –version </code></pre><p class='fs-5 mb-4'>Check the version of ls command</p><pre class='language-html'><code>ls -a </code></pre><p class='fs-5 mb-4'>List all hidden files</p><pre class='language-html'><code>ls -al </code></pre><p class='fs-5 mb-4'>Formatted listing with hidden files</p><pre class='language-html'><code>ls -i </code></pre><p class='fs-5 mb-4'>Display number of file or directory</p><h4 class='italic mb-4'>Termux More Useful Commands</h4><pre class='language-html'><code>rm </code></pre><p class='fs-5 mb-4'>Remove or delete files</p><pre class='language-html'><code>rm [filename] </code></pre><p class='fs-5 mb-4'>Remove any text files</p><pre class='language-html'><code>rmdir [dir name] </code></pre><p class='fs-5 mb-4'>Remove any directory</p><pre class='language-html'><code>rm -rf </code></pre><p class='fs-5 mb-4'>Force remove a directory or a folder</p><pre class='language-html'><code>rm -r [name]</code></pre><p class='fs-5 mb-4'>Delete a directory called name</p><pre class='language-html'><code>pwd</code></pre><p class='fs-5 mb-4'>It show your current working directory</p><pre class='language-html'><code>wget [url] </code></pre><p class='fs-5 mb-4'>Install tool , apt install wget</p><pre class='language-html'><code>git clone [url] </code></pre><p class='fs-5 mb-4'>Install any tools with git clone, apt install git</p><pre class='language-html'><code>curl -O [url] </code></pre><p class='fs-5 mb-4'>apt install curl</p><pre class='language-html'><code>apt search [qurey] </code></pre><p class='fs-5 mb-4'>Use to get available packages</p><pre class='language-html'><code>pkg search [qurey] </code></pre><p class='fs-5 mb-4'>Find a package</p><pre class='language-html'><code>apt remove [package name] </code></pre><p class='fs-5 mb-4'>Uninstall / remove a package</p><pre class='language-html'><code>apt show </code></pre><p class='fs-5 mb-4'>View package information</p><pre class='language-html'><code>more [file name] </code></pre><p class='fs-5 mb-4'>Output the contents of file</p><pre class='language-html'><code>head [file name] </code></pre><p class='fs-5 mb-4'>Output the first 10 line of file</p><pre class='language-html'><code>tail -f [file name] </code></pre><p class='fs-5 mb-4'>Output the contents of file as it grows</p><pre class='language-html'><code>zip name.zip [file] </code></pre><p class='fs-5 mb-4'>Compress file using this commands</p><pre class='language-html'><code>unzip [zip file] </code></pre><p class='fs-5 mb-4'>To unzip file</p><pre class='language-html'><code>bye</code></pre><p class='fs-5 mb-4'>Terminate current ftp session, exit</p><pre class='language-html'><code>bell</code></pre><p class='fs-5 mb-4'>Bell sound after each command</p><pre class='language-html'><code>uname -m </code></pre><p class='fs-5 mb-4'>Used to find the architecture of your device</p><pre class='language-html'><code>uname -a </code></pre><p class='fs-5 mb-4'>Used to display kernal information</p><pre class='language-html'><code>df </code></pre><p class='fs-5 mb-4'>Display disk usages</p><pre class='language-html'><code>cal </code></pre><p class='fs-5 mb-4'>Show display calendar</p><pre class='language-html'><code>w </code></pre><p class='fs-5 mb-4'>Show display who is currently online</p><pre class='language-html'><code>cat /proc/meminfo </code></pre><p class='fs-5 mb-4'>Show memory related information</p><pre class='language-html'><code>cat /proc/cpuinfo </code></pre><p class='fs-5 mb-4'>Show cpu information</p><pre class='language-html'><code>whoami</code></pre><p class='fs-5 mb-4'>Show your login name</p><pre class='language-html'><code>date </code></pre><p class='fs-5 mb-4'>Show the current date and time</p><pre class='language-html'><code>uptime </code></pre><p class='fs-5 mb-4'>Show the system current uptime</p><pre class='language-html'><code>man command </code></pre><p class='fs-5 mb-4'>Show manual a command</p><pre class='language-html'><code>free </code></pre><p class='fs-5 mb-4'>Display memory and swap usage</p><pre class='language-html'><code>kill </code></pre><p class='fs-5 mb-4'>Send signal to process</p><pre class='language-html'><code>kill- l </code></pre><p class='fs-5 mb-4'>List all of the signal that are possible to send with kill</p><pre class='language-html'><code>locate [file] </code></pre><p class='fs-5 mb-4'>Find all files with filename</p><pre class='language-html'><code>whereis [command]</code></pre><p class='fs-5 mb-4'>Find location binary /source/man file for a command</p><pre class='language-html'><code>which [command] </code></pre><p class='fs-5 mb-4'>Find of an executable</p><pre class='language-html'><code>grep pattern [files] </code></pre><p class='fs-5 mb-4'>Searching for pattern in files</p><pre class='language-html'><code>grep -r pattern files </code></pre><p class='fs-5 mb-4'>Searching for certain pattern in files</p><pre class='language-html'><code>command | grep pattern </code></pre><p class='fs-5 mb-4'>Search for pattern in the output of command</p><pre class='language-html'><code>find / -cmin -60 </code></pre><p class='fs-5 mb-4'>Find change files in last 1 hour</p><pre class='language-html'><code>find / -type d -name mll </code></pre><p class='fs-5 mb-4'>Find all directories whose name is mll in directory</p><pre class='language-html'><code>tracerout ip address </code></pre><p class='fs-5 mb-4'>Display number of hops & respone time to get to a remote system and website</p><pre class='language-html'><code>whois domain </code></pre><p class='fs-5 mb-4'>Get whois information of domain</p><pre class='language-html'><code>dig domain </code></pre><p class='fs-5 mb-4'>Get DNS information of domain</p><pre class='language-html'><code>scp</code></pre><p class='fs-5 mb-4'>Copies file, over a source</p><pre class='language-html'><code>whereis app</code></pre><p class='fs-5 mb-4'>Shows possible location for an app</p><pre class='language-html'><code>nano [file name] </code></pre><p class='fs-5 mb-4'>Display and edit text files</p><pre class='language-html'><code>append [local-file] </code></pre><p class='fs-5 mb-4'>Remote file append a local file to one on the remote</p><pre class='language-html'><code>ifconfig</code></pre><p class='fs-5 mb-4'>Shows all configuration a network interface like IP, mac</p><pre class='language-html'><code>ifconfig eth0 </code></pre><p class='fs-5 mb-4'>Used view the network setting on the interface eth0</p><pre class='language-html'><code>ifconfig wlan0 </code></pre><p class='fs-5 mb-4'>View the network setting on wlan0</p><pre class='language-html'><code>ping [host]</code></pre><p class='fs-5 mb-4'>To ping host ip and show results</p><pre class='language-html'><code>arp</code></pre><p class='fs-5 mb-4'>Check network card & show IP address</p><pre class='language-html'><code>host </code></pre><p class='fs-5 mb-4'>Display specific server</p><h4 class='italic mb-4'>Termux Common Programs</h4><pre class='language-html'><code>pkg i p7zip</code></pre><p class='fs-5 mb-4'>To install 7z zip package</p><pre class='language-html'><code>pkg i ffmpeg</code></pre><p class='fs-5 mb-4'>To install FFMpeg package</p><pre class='language-html'><code>pkg i git</code></pre><p class='fs-5 mb-4'>To install Git package</p><pre class='language-html'><code>pkg i hydra</code></pre><p class='fs-5 mb-4'>To install Hydra package</p><pre class='language-html'><code>pkg i nano</code></pre><p class='fs-5 mb-4'>To install Nano package</p><pre class='language-html'><code>pkg i nmap</code></pre><p class='fs-5 mb-4'>To install Nmap package</p><pre class='language-html'><code>pkg i nodejs</code></pre><p class='fs-5 mb-4'>To install Node package</p><pre class='language-html'><code>pkg i python2 && pip2 install -U sqlmap</code></pre><p class='fs-5 mb-4'>SQLMap</p><pre class='language-html'><code>pkg i vim</code></pre><p class='fs-5 mb-4'>To Install Vim package</p>",
            "tags": [
                "Termux"
            ],
            "date": "November 09, 2021",
            "linkedin": "https://www.linkedin.com/in/bhavik-oza-678118134",
            "github": "https://github.com/Bhaviktutorials"
        },
        {
            "id": 5,
            "author": "Murtaza Fatakdawala",
            "firstName": "Murtaza",
            "LastName": "Fatakdawala",
            "shortTitle": "IS ELON MUSK A “CRYPTO WIZARD” ?",
            "category": "General",
            "img": "/assets/images/General/id5/id5.png",
            "shortDesc": "Is Elon Musk A “CRYPTO WIZARD” ?",
            "blogContent": "<p class='fs-5 mb-4'>I am quite sure we all know who Mr. Elon Musk is! But for the record Elon Reeve Musk FRS is an entrepreneur and business magnate. He is the founder, CEO, and Chief Engineer at SpaceX; early-stage investor, CEO, and Product Architect of Tesla, Inc.; founder of The Boring Company; and co-founder of Neuralink and OpenAI.</p><p class='fs-5 mb-4'>Let us travel back a year behind, if someone says Elon Musk the first thing that came to our mind was Tesla or SpaceX. But now if we hear the name Elon Musk the first thing that comes to our mind is Bitcoin or Cryptocurrency. That is what Mr. Musk has changed in past 1 year. What is Cryptocurrency though? Well A cryptocurrency, crypto-currency, or crypto is a collection of binary data which is designed to work as a medium of exchange. Individual coin ownership records are stored in a ledger, which is a computerized database using strong cryptography to secure transaction records, to control the creation of additional coins, and to verify the transfer of coin ownership.</p><h2 class='fw-bolder mb-4 mt-5'>Why is Elon Musk a Crypto Wizard?</h2><p class='fs-5 mb-4'>Well apart from building spaceships and sending cars into space or creating worlds most advance electric vehicles. Elon Musk has a reputation of playing with the crypto market. Every time Mr. Musk has tweeted something regarding crypto currencies the crypto market has reacted and changed drastically. But what actually happened ?</p><p class='fs-5 mb-4'>On 4th June 2021 Mr. Musk sitting on his expensive sofa just tweeted a breakup heart emoji with #BITCOIN.</p><p class='fs-5 mb-4'>But what can a tweet really do?</p><p class='fs-5 mb-4'>Well, the value of Bitcoin sank from $64,000 to $30,000 in 1 night. Yes, that’s a steep fall especially for heavy bitcoin investors.</p><img class='img-fluid rounded' src='/assets/images/General/id5/id5.1.png'/><p class='fs-5 mb-4'>Along with Bitcoin even Ethereum and Dogecoin fell.</p><p class='fs-5 mb-4'>Well, this was not the first time where such a thing happened. In May Mr. Musk said that Tesla will not be accepting any payments in Bitcoins due to heavy energy usage. Due to this the whole cryptocurrency market fell in one day.</p><p class='fs-5 mb-4'>Elon Musk tweeted that he owns only 3 crypto currencies I.E. </p><p class='fs-5 mb-4'>On 25th October 2021.</p><ol class='fs-5 mb-4'> <li>Bitcoin</li><li>Ethereum</li><li>Dogecoin</li></ol><p class='fs-5 mb-4'>This is the sole reason these 3 are the highest performing cryptos. </p><h2 class='fw-bolder mb-4 mt-5'>But why can Elon Musk control the whole Crypto market ?</h2><p class='fs-5 mb-4'>The main reason is he owns two largest powerhouses that accepts payments in the form of cryptocurrencies. It is also because of his social media influence and impact of his opinion on crypto markets.</p><p class='fs-5 mb-4'>So make sure you check twitter before investing in crypto market next time !</p>",
            "tags": [
                "Crypto"
            ],
            "date": "November 15, 2021",
            "linkedin": "https://www.linkedin.com/in/murtaza-fatakdawala-a006651ab/",
            "github": "https://github.com/Murtaza11092"
        },
        {
            "id": 6,
            "author": "Piyush Dixit",
            "firstName": "Piyush",
            "LastName": "Dixit",
            "shortTitle": "Front-end Web Development",
            "category": "Web-Dev",
            "img": "/assets/images/Web-Dev/id6/id6.jpg",
            "shortDesc": "A detailed briefing & working of Front-end Web dev domain.",
            "blogContent": "<h2 class='fw-bolder mb-4 mt-5'>Front-End Web development</h2><p class='fs-5 mb-4'>Every web developer must have a basic understanding of HTML, CSS and JavaScript. Let's look into the technical terms based on which the actual code runs. Focusing sequentially on </p><ol class='fs-5 mb-5'> <li>HTML</li><li>CSS</li><li>JavaScript</li></ol><h2 class='fw-bolder mb-4 mt-5'>HTML :</h2><h2 class='fw-bolder mb-4 mt-5'>What is HTML ?</h2><p class='fs-5 mb-4'>HTML is a markup language that defines the structure of your content. HTML consists of a series of elements, which you use to enclose, or wrap, different parts of the content to make it appear a certain way, or act a certain way. The enclosing tags can make a word or image hyperlink to somewhere else can italicize words, can make the font bigger or smaller, and so on. For example, take the following line of content:</p><h2 class='fw-bolder mb-4 mt-5'>Structure of HTML Element</h2><img class='img-fluid rounded' src='/assets/images/Web-Dev/id6/id6.1.jpg' ><p class='fs-5 mb-4'>To provide additional information to the HTML element there is a concept called HTML attributes.</p><h2 class='fw-bolder mb-4 mt-5'>HTML Attributes:</h2><ul class='fs-5 mb-4'> <li>HTML attributes are the special words which provide additional information to the HTML element.</li><li>Each element or tag can have their own attributes</li><li>There are few attributes which are known as global attributes, since they can be applied to any element present in the HTML document. e.g., style, class, id, title, etc.</li><li>Attribute names are case sensitive and should be written in lowercase only.</li><li>There can be multiple attributes in the same element.</li></ul><img class='img-fluid rounded' src='/assets/images/Web-Dev/id6/id6.2.png' ><h2 class='fw-bolder mb-4 mt-5'>CSS Syntax :</h2><img class='img-fluid rounded' src='/assets/images/Web-Dev/id6/id6.3.png'><h2 class='fw-bolder mb-4 mt-5'>What Is CSS ?</h2><p class='fs-5 mb-4'>CSS stands for Cascading Style Sheets. It is the language for describing the presentation of Web pages, including colours, layout, and fonts, thus making our web pages presentable to the users.</p><h2 class='fw-bolder mb-4 mt-5'>JavaScript :-</h2><p class='fs-5 mb-4'>There are 3 ways to declare a JavaScript variable : </p><ul class='fs-5 mb-4'> <li>var</li><li>let</li><li>const</li></ul><h2 class='fw-bolder mb-4 mt-5'>var :</h2><p class='fs-5 mb-4'>Variable is a container that is used for storing data (values). It basically works like math algebra wherein, you assign values. <br>Eg :<pre class=\"language-javascript\"><code>var x=5;<br>var y=6;<br>var z = x + y;<br>//Apparently, var z will store the value 11.</code></pre>All JavaScript variables must be identified with unique names.These unique names are called identifiers.</p><h2 class='fw-bolder mb-4 mt-5'>let :</h2><p class='fs-5 mb-4'>let can declare the JS variable in the same way as we did with “var”. Just the case with “let” is that it does not let you re-declare a variable that is already declared.<br>Eg - <pre class=\"language-javascript\"><code>let x = \"HackClub\";<br>let x = \"7\";<br>// SyntaxError : ‘x’ has already been declared.</code></pre> </p><h2 class='fw-bolder mb-4 mt-5'>const :</h2><p class='fs-5 mb-4'>In const you can’t re-declare or re-assign a declared variable. JS const variables must be assigned a value when they are declared.<br>Eg - <pre class=\"language-javascript\"><code>const dec = 12;</code></pre> As a general rule, always declare a variable with const unless you know that the value will change. </p><h2 class='fw-bolder mb-4 mt-5'>JS DataTypes : </h2> <ul class='fs-5 mb-4'> <li>String : A string ( or a text string ) is a series of characters like “sunny day”.</li>Eg :<pre class=\"language-javascript\"><code>let quote = 'The best way to predict the future is to create it.';</code></pre> <li>JS Numbers : JavaScript has only one type of numbers. Numbers can be written with or without decimals.</li>Eg :<pre class=\"language-javascript\"><code>let y = 69;<br>let z = 07;</code></pre> <li>JS Booleans : Booleans only have 2 values. It is used when you have only 2 values like yes/no, true/false, on/off.</li>Eg :<pre class=\"language-javascript\">let x = 7;<br>let y = 8;<br>let z = 7;<br>( x == y ) // returns false.<br>( x == z ) // returns true.<code></code></pre> <li>JS Arrays : Array is a special variable, which can hold more than one value. An array can hold many values under a single name, and you can access the values by referring to an index number.</li>Syntax : <pre class=\"language-javascript\"><code>const array_name = [item1, item2, ...];</code></pre> <li>JS Objects : It is used to store various keyed collections and more complex entities.</li>Eg :<pre class=\"language-javascript\"><code>const person = {name:'John', age: 23, height:'5.9 feet'};</code></pre> <li>JS Undefined : In JS, a variable without a value, has the value undefined. The type is also undefined.</li>Eg :<pre class=\"language-javascript\"><code>let pool; // Value is undefined, type will also be undefined.</code></pre> <li>Empty values : Empty values does not imitate “undefined”, it is a different data type</li>Eg :<pre class=\"language-javascript\"><code>let pool=''; // The value is '', the typeof is 'string'.</code></pre></ul><h2 class='fw-bolder mb-4 mt-5'>JS Functions :</h2><p class='fs-5 mb-4'>Imagine If a person has to make a call in the evening. The first thing he will do is set a reminder which will alert him about the call in the evening. In the same way a function generally works. JS Function is a block of code designed to perform a particular task and it is executed when “something” invokes it (calls it).</p>Eg :<pre class=\"language-javascript\"><code>function myFunction(p1, p2){<br>    return p1 * p2; // The function returns the product of p1 and p2<br>}</code></pre><p class='fs-5 mb-4'>The code to be executed, by the function, is placed inside curly brackets:{}</p><p class='fs-5 mb-4'>Function Invocation : </p><p class='fs-5 mb-4'>When JavaScript reaches a return statement, the function will stop executing.</p><p class='fs-5 mb-4'>If the function was invoked from a statement, JavaScript will 'return' to execute the code after the invoking statement.</p><p class='fs-5 mb-4'>Functions often compute a return value. The return value is 'returned' back to the 'caller'.</p><h2 class='fw-bolder mb-4 mt-5'>Why Functions?</h2><p class='fs-5 mb-4'>“You can reuse code: Define the code once, and use it many times.</p><p class='fs-5 mb-4'>You can use the same code many times with different arguments, to produce different results”.</p><p class='fs-5 mb-4'>The () Operator Invokes the Function</p><p class='fs-5 mb-4'>Note : Accessing a function without () will return the function object instead of the function result.</p><h2 class='fw-bolder mb-4 mt-5'>FRAMEWORKS :</h2><p class='fs-5 mb-4'>Web Application Framework or simply “web framework” is a software framework that is designed to support the development of web applications including web services, web resources, and web APIs. Frameworks are, in short, libraries that help you develop your application faster and smarter!</p><p class='fs-5 mb-4'>Web FrameWorks like “BOOTSTRAP”, “SEMANTIC UI”, “TAILWIND”, “MATERIALIZE CSS”, etc are generally based on HTML, CSS and JS which helps in creating intriguing, responsive and interactive web designs.</p><h2 class='fw-bolder mb-4 mt-5'>JS LIBRARIES :</h2><ul class='fs-5 mb-4'> <li> <h2 class='fw-bolder mb-4 mt-5'>What is a JavaScript Library?</h2> <p class='fs-5 mb-4'>A library is a JavaScript file that contains a bunch of functions, and those functions accomplish some useful tasks for your webpage. Most libraries have documentation with a list of available functions or a real-world example.</p><p class='fs-5 mb-4'>Some of the most preferred JS libraries are JQuery, AngularJS, Vue.JS, ReactJS, they also allow developers to create scalable single-page websites.</p></li></ul><h2 class='fw-bolder mb-4 mt-5'>This might lead to a question: </h2> <p class='fs-5 mb-4'>What is the difference between a Framework and a Library?</p><p class='fs-5 mb-4'>When you use a library, you are in charge of the flow of the application. You are choosing when and where to call the library. When you use a framework, the framework is in charge of the flow. It provides some places for you to plug in your code, but it calls the code you plugged in as needed.</p><h2 class='fw-bolder mb-4 mt-5'>“Front-End is all about being technically creative while delivering a responsive web design”</h2>",
            "tags": [
                "Web Development"
            ],
            "date": "November 26, 2021",
            "linkedin": "https://www.linkedin.com/in/piyush-dixit-327055218",
            "github": "https://github.com/PiyushDixit7"
        },
        {
            "id": 7,
            "author": "Dikshita padte",
            "firstName": "Dikshita",
            "LastName": "Padte",
            "shortTitle": "Supervised Machine Learning",
            "category": "AI-ML",
            "img": "/assets/images/AI-ML/id7/id7.jpg",
            "shortDesc": "Supervised Machine Learning",
            "blogContent": "<p class='fs-5 mb-4'>Supervised Machine Learning is a type of Machine Learning Algorithm in which training data labeled with correct output is provided and the model is trained based on this already labeled data. Then some unknown but similar kind of data is provided to the model and is asked to predict the output based on this new data.</p><p class='fs-5 mb-4'>It is similar to like a teacher first trains the student based on solved examples (as solved examples already have the answers and solution displayed) and then the teacher provides some unknown but similar set of questions to the students and tests the ability of the students to solve those unknown set of questions. Here the student is the model, the teacher is you, solved examples are the training data and an unknown set of questions is the testing data</p><img class='img-fluid rounded' src='assets/images/AI-ML/id7/id7.1.png' alt=''><p class='fs-5 mb-4'>Here the labeled data represented above are the input shapes given to the model and labels are named (Hexagon, Triangle, Square) which is the target data. So here the task of the Machine Learning Model is to identify whether the input shape is Hexagon, Triangle, or Square.</p><p class='fs-5 mb-4'>Here Firstly the input(labeled data) and output(Labels) both are given to the model and the model is trained based on both these data. Then once the model is fully trained, an unknown set of data(Test data) is passed into the model and now the model has to identify the shape on the test data which is called predicting the output.</p><p class='fs-5 mb-4'>If the model correctly predicts most of the outputs then it is considered to be a good model or else a bad model. Model is working fine or not is acknowledged by calculating the accuracy of the model.</p><H2 class='fw-bolder mb-4 mt-5'>Steps involved in Supervised Machine Learning</H2><p class='fs-5 mb-4'>1. Collect the appropriate dataset with features and target variables.</p><p class='fs-5 mb-4'>2. Perform data preprocessing(data cleaning, data wrangling, etc)</p><p class='fs-5 mb-4'>3. Separate the features and target variables(i.e separate input data and output data to avoid overfitting)</p><p class='fs-5 mb-4'>4. Split the data into training and testing data using train_test_split from the sklearn package.</p><img class='img-fluid rounded' src='assets/images/AI-ML/id7/id7.2.png' alt=''><p class='fs-5 mb-4'>5. Choose the suitable Machine Learning Algorithm which best fits your data.</p><p class='fs-5 mb-4'>6. Test the model based on testing data.</p><p class='fs-5 mb-4'>7. Calculate the accuracy of the model. If the target data is continuous you can use the accuracy_scrore function for calculating the accuracy and if the target data is categorical then you can use either accuracy_score() or confusion matrix.</p><div class='mb-4'> <img class='img-fluid rounded' src='assets/images/AI-ML/id7/id7.3.png' alt=''></div><div class='mb-4'> <img class='img-fluid rounded' src='assets/images/AI-ML/id7/id7.4.png' alt=''></div><div class='mb-4'> <img class='img-fluid rounded' src='assets/images/AI-ML/id7/id7.5.png' alt=''></div><H2 class='fw-bolder mb-4 mt-5'>Types of Supervised Machine Learning Algorithm</H2><p class='fs-5 mb-4'>Supervised Machine Learning has two types of Algorithm:</p><img class='img-fluid rounded' src='assets/images/AI-ML/id7/id7.6.png' alt=''><p class='fs-5 mb-4'>A classification algorithm is applied when the target data (output data ) have labels or are categorical. This algorithm is used when the data has to be categorized into different classes.</p><p class='fs-5 mb-4'>For eg: A classification algorithm can be applied to the below dataset as the target variables consist of labels like High Temperature, Moderate temperature, and Low Temperature.</p><img class='img-fluid rounded' src='assets/images/AI-ML/id7/id7.7.png' alt=''><p class='fs-5 mb-4'>Below are some of the commonly used Classification Algorithms:</p><ul class='fs-5 mb-4'> <li>Logistic Regression</li><li>Support vector Machines</li><li>Random Forest</li><li>Decision Trees</li></ul><img class='img-fluid rounded' src='assets/images/AI-ML/id7/id7.8.png' alt=''> <p class=' fs-5 mb-4'>Some of the popular Regression Algorithms:</p><ul class='fs-5 mb-4'> <li>Linear Regression</li><li>Bayesian Linear Regression</li><li>Polynomial Regression</li><li>Regression Trees</li><li>Non-Linear Regression</li></ul><h2 class='fw-bolder mb-4 mt-5'>Uses</h2><ul class='fs-5 mb-4'> <li>Fraud Detection</li><li>Risk Assesment</li><li>Spam Filtering</li></ul>",
            "tags": [
                "AI-ML"
            ],
            "date": "December 1, 2021",
            "linkedin": "https://www.linkedin.com/in/dikshita-padte-665794209",
            "github": "https://github.com/dikshita-1905/"
        },
        {
            "id": 8,
            "author": "Dikshita padte",
            "firstName": "Dikshita",
            "LastName": "Padte",
            "shortTitle": "Unsupervised Machine Learning",
            "category": "AI-ML",
            "img": "/assets/images/AI-ML/id8/id8.jpg",
            "shortDesc": "Unsupervised Machine Learning",
            "blogContent": "<p class='fs-5 mb-4'>Unsupervised Machine Learning is a type of Machine Learning algorithm in which the data provided to the model is not labeled. Here the model needs to find the hidden patterns from the dataset by itself to get trained. This model is trained based on an unlabeled dataset.</p><p class='fs-5 mb-4'>In simple terms, this is analogous to a student not being trained using solved examples by the teacher but instead, the student has to train himself using unsolved examples and find its solutions.</p><p class='fs-5 mb-4'>As this student does not need a teacher, similarly our model does not need any kind of supervision here. Hence it's called Unsupervised Machine Learning.</p><p class='fs-5 mb-4'>Unsupervised Machine Learning cannot be applied to regression and classification problems because here unlike supervised Machine Learning no output data is present.</p><p class='fs-5 mb-4'>Let's understand it with an example:</p><p class='fs-5 mb-4'>Here we have input data as the number of images of cats and dogs. This image data is unlabeled or uncategorized. Now, these images are passed to the model, but here only the input data(i.e images) are passed whereas output data(labels like cat or dog) is not passed. Also, no features are already provided to the model while the training process, rather the model has to identify the features by itself.</p><img class='img-fluid rounded' src='/assets/images/AI-ML/id8/id8.1.png' ><p class='fs-5 mb-4'>Here by features I mean that the above characteristics of these two animals differentiate them as cats or dogs. These features are to be identified by the model by itself during the training process(i.e identifying the hidden patterns). Once these features of cats and dogs are identified by the model, its task is to separate these two types of images into different clusters. Once the hidden patterns are identified now it selects the appropriate unsupervised machine learning algorithm such as k-means clustering, Apriori algorithm, KNN Classification, etc and then classifies the images with similar features as part of one cluster(or group) and the dissimilar images as part of another cluster(or group).</p><img class='img-fluid rounded' src='/assets/images/AI-ML/id8/id8.2.png' ><p class='fs-5 mb-4'>Similarly, the cats and dogs are grouped into two different clusters by applying the suitable algorithm and now after clustering, labels are assigned to these clusters(i.e one cluster belongs to cats and the other cluster belongs to dogs).</p><p class='fs-5 mb-4'>Another Example:</p><p class='fs-5 mb-4'>Here various shapes are provided as input data to the model as raw data for identifying the hidden patterns from the data.</p><img class='img-fluid rounded' src='/assets/images/AI-ML/id8/id8.3.png' ><p class='fs-5 mb-4'>After that, a suitable algorithm is applied and the shapes are categorized into different clusters labeled as triangle, cube, and circle.</p><h3 class='fw-bolder mb-4 mt-5'>Below is the difference between a supervised machine learning algorithm and an unsupervised machine learning algorithm:</h3><img class='img-fluid rounded' src='/assets/images/AI-ML/id8/id8.4.png' ><p class='fs-5 mb-4'>In supervised Machine Learning, input data (images of apple) along with the labels is passed to the model and the model is trained based on these images and labels. Once the model is trained, then it is checked with the set of unknown data and gives the label of the unknown image as predicted output.</p><p class='fs-5 mb-4'>In unsupervised machine learning, the images of bananas, apples, and peaches will be passed without labels. Once these images are passed the model identifies the features and based on this, divides them into different clusters as the output.</p><h2 class='fw-bolder mb-4 mt-5'>Types of Unsupervised Machine Learning</h2><p class='fs-5 mb-4'>The Unsupervised Machine Learning can be divided into two types:</p><img class='img-fluid rounded' src='/assets/images/AI-ML/id8/id8.5.png' ><h2 class='fw-bolder mb-4 mt-5'>Clustering:</h2><p class='fs-5 mb-4'>Clustering is a technique that is used to group similar items or data into one cluster and dissimilar items or data into another cluster. The similarity is measured by identifying the features and then mapping these features as similar or dissimilar.</p><h3 class='fw-bolder mb-4 mt-5'>Types of Clustering Algorithm:</h3><ul class='fs-5 mb-4'> <li>Exclusive Clustering Algorithm</li><li>Overlapping Clustering Algorithm</li><li>Hierarchical Clustering Algorithm</li><li>Probabilistic Clustering Algorithm</li></ul><h2 class='fw-bolder mb-4 mt-5'>Association:</h2><p class='fs-5 mb-4'>Association rule is used to establish a relationship or associations between data objects or variables in large datasets. It is widely used to make the market strategy more effective like if a customer is buying product X(bread) then he is more likely to buy product Y, Z( eggs, butter/jam). Hence, you can observe that eggs, butter, jam, etc are always kept beside bread in malls and supermarkets as a marketing strategy. This is called Market Basket Analysis which helps to develop relationships between various products.Another example can be people who have bought a new house are more likely to buy new furniture.</p><h3 class='fw-bolder mb-4 mt-5'>Types of Association Algorithms</h3><ul class='fs-5 mb-4'> <li>Apriori Algorithm</li><li>FP Growth Algorithm</li><li>Eclat</li></ul><h2 class='fw-bolder mb-4 mt-5'>Advantages:</h2><ol class='fs-5 mb-4'> <li>Used to gain better insights from the data.</li><li>It works with unlabeled and uncategorized data.</li><li>In the real world, we don't always have the output to the corresponding input data. In these cases, an Unsupervised Machine Learning algorithm can be very useful.</li></ol><h2 class='fw-bolder mb-4 mt-5'>Disadvantages:</h2><ol class='fs-5 mb-4'> <li>Computational Complexity is more</li><li>Longer Training times</li><li>High risk of inaccurate results</li></ol><h2 class='fw-bolder mb-4 mt-5'>Applications:</h2><ol class='fs-5 mb-4'> <li>Exploratory data analysis</li><li>Cross-selling strategies</li><li>Customer segmentation</li><li>Computer Vision(Object Recognition)</li><li>Medical Imaging(eg. Radiology and pathology)</li><li>Image Classification, detection, and Recognition</li><li>Recommendation Engines</li></ol>",
            "tags": [
                "AI-ML"
            ],
            "date": "December 2, 2021",
            "linkedin": "https://www.linkedin.com/in/dikshita-padte-665794209",
            "github": "https://github.com/dikshita-1905/"
        },
        {
            "id": 9,
            "author": "Roshani Surwade",
            "firstName": "Roshani",
            "LastName": "Surwade",
            "shortTitle": "SLAM USING MATLAB",
            "category": "General",
            "img": "/assets/images/General/id9/id9.jpeg",
            "shortDesc": "SLAM USING MATLAB",
            "blogContent": "<h2 class='fw-bolder mb-4'>1. &nbsp; What is SLAM?</h2><ul class='fw-bolder mb-4'> <li>SLAM (Simultaneous Localization And Mapping) is a method used in autonomous vehicles that lets you build a map and localize your vehicle in that map at the same time. SLAM algorithm allows the vehicle to map out unknown environments</li><li>SLAM is a technique used to build up a map within an unknown or a known environment while at the same time keeping track of the current location</li></ul><img class='img-fluid rounded' src='/assets/images/General/id9/id9.1.jpeg' alt=''><ul class='fw-bolder mb-4'> <li>The problem has two stages</li><ol> <li>Mapping</li><li>Localization</li></ol></ul><ul class='fw-bolder mb-4'> <li>The Paradox:</li><ol> <li>While building the map, we must know our position</li><li>To determine our position, we need a map!</li></ol></ul><h2 class='fw-bolder mb-4'>2. &nbsp; Why SLAM is a hard problem?</h2><ul class='fw-bolder mb-4'> <li>Both SLAM robot path and map is unknown. </li></ul><img class='img-fluid rounded' src='/assets/images/General/id9/id9.2.jpeg' alt=''><ul class='fw-bolder mb-4'> <li>Robot Path error correlates errors in the map</li></ul><img class='img-fluid rounded' src='/assets/images/General/id9/id9.3.jpeg' alt=''><ul class='fw-bolder mb-4'> <li>In the real world, mapping between observations and landmarks is unknown</li><li>Picking wrong data associations can have catastrophic consequences</li><li>Pose error correlates data associations</li><li>Small Error accumulate to arbitrary large global errors.</li><li>This is usually irrelevant for navigation.</li><li>While closing the loops, global error does matter.</li></ul><h2 class='fw-bolder mb-4'>3. &nbsp; SLAM Algorithm There are Two algorithm</h2><ul class='fw-bolder'> <li>Extended Kalman Filter SLAM:</li></ul><ol> <p>It solves the online SLAM problem. It uses Linearized Gaussian Probability Distribution Model</p></ol><ul class='fw-bolder'> <li>Fast SLAM:</li></ul><ol> <p>It solves the full problem and uses Sampled Particle Filter Distribution Model</p></ol><h2 class='fw-bolder mb-4'>4. &nbsp; Features of SLAM</h2><ul class='fw-bolder mb-4'> <li>Landmark extraction</li><li>Data association</li><li>Estimate a vehicles pose</li><li>We have to build this model of the environment map.</li><li>Location and orientation</li><li>State update</li><li>Landmark update</li></ul><h2 class='fw-bolder mb-4'>5. &nbsp; SLAM Application</h2><ul class='fw-bolder mb-4'> <li>It is used for automated car piloting on off road terrain.</li><li>It is used for visual surveillance systems.</li><li>Indoors</li><li>Undersea</li><li>Space</li><li>Underground</li></ul>",
            "tags": [
                "General"
            ],
            "date": "December 10, 2021",
            "linkedin": "https://www.linkedin.com/in/roshani-surwade-164732205",
            "github": "https://github.com/roshanisurwade617"
        }
    ]
}